// Присвоение целой переменной значения 12.
int numberA = 12;
// Присвоение целой переменной згначения 5
int numberB = 5;
// Вывод результата деления в консоль (терминал) с переводом курсора на следующую строку.
Console.WriteLine(numberA / numberB); // Значение равно 2.
// Присвоение вещественной переменой значения 12.
double numberC = 12;
// Присвоение вещественной переменой значения 5.
double numberD = 5;
// Вывод результата деления в консоль (терминал) с переводом курсора на следующую строку.
Console.WriteLine(numberC / numberD); // Значение равно 2,4.